Repository: pmespace/PMS.NEXO
Catalog: Listener.30/Properties/Resources.*.resx
Languages: fr

# DisplayingQRCode
source: Displaying QRcode or BarCode
fr: Affichage d'un QRcode ou d'un code barres

# DisplayingPredefinedContent
source: Displaying predefined content [{0}]
fr: Affichage d'un contenu prédéfini [{0}]

source: Displaying XHTML content
fr: Affichage d'un contenu XHTML

# InvalidDisplayDevice
source: Invalid display device request [{0}]
fr: Ecran d'affichage invalide [{0}]

# DeviceDisplayAlwaysSucceed
source: No error DeviceDisplay
fr: Mode sans échec du DeviceDisplay

# NotificationAbortHasNotBeenProcessed
source: Abort request has not been processed
fr: L'annulation de transaction n'a pas pu être traitée

# NotificationMiscellaneousProcessing
source: Notification processed through miscellaneous processing
fr: Traitement dégradé de la notification

# NotificationForEvent
source: Notification for event {0} [{1}]
fr: Notification de l'évènement {0} [{1}]

source: POI is already in use
fr: Le terminal est en cours d'utilisation

source: POI access has been granted
fr: L'accès au terminal a été accordé

# LoginTryingToLogWith
source: Trying to log from SaleID {0} to POIID {1}
fr: Tentative de connexion depuis la caisse {0} au terminal {1}

# LoginFailedToLogTo
source: Failed to log from SaleID {0} to POIID {1}
fr: Echec de la connexion de la caisse {0} au terminal {1}

# ServiceStarting
source: Starting service {0}
fr: Démarrage du service {0}

# ServiceCompleted
source: Service {0} completed
fr: Le service {0} est terminé

# Logout
source: Logging out SaleID {0} from POIID {1}
fr: Déconnexion de la caisse {0} du terminal {1}

# LoginSucceeded
source: Logged to POI
fr: Connecté au terminal

# ErrorMessageCantBeConvertedToRequest
source: message can't be converted to a request {0}
fr: Le message ne peut être traduit en une requête [{0}]

# ErrorRequestedPOIDoesntExist
source: requested POI {0} does not exist, the request will not be carried out
fr: Le terminal demandé [{0}] n'existe pas. La requête ne sera pas traitée

# ErrorInvalidRequestedService
source: The requested service is invalid [{0}]"
fr: Le service demandé est invalid [{0}]"

# ErrorRequestedServiceNotAllowed
source: The requested service is not allowed {0}
fr: Le service demandé n'est pas autorisé [{0}]

# ErrorInvalidRequestedIDs
source: The request parameters are not set properly, SaleID: {0}, POIID: {1}
fr: Les paramètres d'identification sont invalides, SaleID: {0}, POIID: {1}

source: <is missing>
fr: <est manquant>

# ErrorFailedCreatingTheNexoObject
source: Failed creating the nexo object {0}, no more processing will occur
fr: La création de l'objet nexo {0} a échouée, le traitement a été interrompu

# ProcessingConnectedToPOI
source: Connected to POI
fr: Connecté au terminal

# ProcessingErrorWhileLogin
source: An error has occurred while trying to log to the POI
fr: Une erreur s'est produite lors de la connexion au terminal

# ProcessingErrorWhileExchange
source: An error has occurred while trying to exchange the nexo retailer {0} order
fr: Une erreur s'est produite lors de l'échange du message nexo {0}

# ProcessingErrorConnectingToPOI
source: Error connecting to the POI at {0}, no more processing can be made
fr: Erreur de connexion au terminal à l'adresse {0}, le traitement ne peut se poursuivre

# ProcessingException
source: An exception has occurred while processing the request [{0}]
fr: Une exception s'est produite durant le traitement de la requête [{0}]

# ProcessingTimeout
source: Timeout receiving the response to {0} request
fr: Timeout à la réception de la réponse à la requête {0}

# ProcessingCancelled
source: Operation manually cancelled while processing {0} service
fr: L'opération a été annulée par l'opérateur durant le traitement du service {0}

# ProcessingResult
source: Processing of service {0} ended up with {1} result {2}
fr: Le traitement du service {0} s'est terminé avec un statut {1} {2}

# ProcessingUnknowError
source: Unknown error while processing service {0} ({1})
fr: Erreur inconnue durant le traitement du service {0}

# ProcessingNoMoreAction
source: Service {0} ended with a noMoreAction status
fr: Le service {0} s'est terminé avec un statut noMoreAction

# ProcessingReceived
source: Received an reply for service {0}
fr: Réception d'une réponse pour le service {0}

# WSInterfaceFailedToConnectToListener
source: Failed connecting to the processing server
fr: Impossible de se connecter au serveur

# WSInterfaceFailedSendingDataToListener
source: Failed sending data to the listener
fr: L'envoi des données au listener a échoué

source: Connection has been cancelled
fr: Déconnexion en cours

# WSInterfaceIncomingConnection
source: Incoming connection
fr: Connexion entrante

# WSInterfaceWaitingSecurityDetails
source: Waiting security details
fr: En attente des éléments d'authentification

# WSInterfaceReceivedSecurityDetails
source: Received security details: {0}
fr: Réception des éléments d'authentification: {0}

# WSInterfaceLoginOK
source: Login to WS interface granted
fr: Login à l'interface WS accordé

# SendingLoginResult
source: Sending login result: {0}
fr: Résultat de l'authentification: {0}

# WSInterfaceConnectedToListener
source: Connected to listener at {0}
fr: Connecté au listener à l'adresse {0}

source: received message
fr: message reçu

# WSInterfaceNotWSRequest
source: Received HTTP request, connection is being closed with status {0}
fr: Réception d'une requête HTTP, la connexion va être fermée avec le code retour {0}

# WSInterfaceStopped
source: The listener WS interface stopped with result code {0}
fr: L'interface WS du listener s'est arrêtée avec le code d'erreur {0}

# POISConnectionSettings
source: Connection settings
fr: Paramètres de connexion

source: <none>
fr: <aucun>

# DisplayLogFile
source: Log file: {0}
fr: Fichier log

# DisplayStarting
source: Trying to read settings from {0}
fr: Tentative de lecture des paramètres depuis

# DisplayFailedToReadSettings
source: Failed to read settings
fr: La lecture des paramètres a échoué

# DisplayAddress
source: IP address {0}: {1} ({2})
fr: Adresse IP

# DisplayFailedToConnectToEListener
source: Listener connection to EListener server process failed to start, shutting down
fr: Le processus de connexion au EListener n'a pas pu se lancer, arrêt du listener

# DisplayFailedToStartWSInterface
source: listener WS interface failed to start, shutting down
fr: L'interface WS n'a pas pu être démarrée, arrêt du listener

# WSInterfaceWaitingForIncomingData
source: Waiting incoming data
fr: En attente de données à recevoir

# WSInterfaceConnectionHasBeenClosed
source: Connection from {0} has been closed
fr: La connexion depuis {0} a été fermée

source: Unknown error
fr: Erreur inconnue

# ERROR_FailedToAddWSClient
source: Failed to insert {0} in the list of current clients
fr: L'enregistrement de la connexion depuis {0}

# INFOR_StartingWSInterface
source: Starting listener WS interface
fr: Démarrage de l'interface WS du listener

# TRACE_WSInterfaceStarted
source: Listener WS interface started
fr: L'interface WS du listener démarrée

# ERROR_WSInterfaceNotStarted
source: Listener WS interface failed to start
fr: L'interface WS du listener n'a pas pu être démarrée

# ERROR_WSClientHasStopped
source: The listener process connected to WS server has terminated, shutting down
fr: Le processus listener connecté au WS server s'est arrêté, arrêt du listener

# WSClientConnectingToServer
source: Client listener trying to connect to {0} (attempt {1})"
fr: Tentative de connexion du listener client à {0} (tentative {1})

# WSClientIsConnected
source: Client listener is connected to {0}
fr: Le listener client est connecté à {0}

# WSClientFailedToConnect
source: Client listener failed to connect to the WS server at {0}, another attempt will be made in {1} seconds
fr: Le listener client n'a pas pu se connecter au serveur à l'adresse {0}, une nouvelle tentative sera faite dans {1} secondes

# WSClientTerminated
source: Client listener has been terminated, shutting down
fr: Le listener client s'est arrêté, arrêt du listener

# WSInterfaceLoginKO
source: Login to WS interface denied
fr: Login à l'interface WS refusé

source: WS interface disconnected
fr: L'interface WS a été déconnectée

# FailedInsertingConnectedClient
source: Failed saving incoming connection to list of current clients
fr: L'enregistrement de la connexion entrante a échoué

# InputDataFailedToSetData
source: Failed settings data {0} to value {1}
fr: Attribuer la valeur {1} à la donnée {0} a échoué

# InputDataFailedCreatingPath
source: Failed creating the data path {0}, that data won't be set
fr: La création du chemin d'accès de la donnée {0} a échoué, cette donnée ne sera pas valorisée

# ProcessingPerformingAutoLogin
source: Performing auto-login
fr: Auto-login en cours

# ProcessingPerformingAutoLogout
source: Performing auto-logout
fr: Auto-logout en cours

# OutputDataFailedFetchingData
source: Failed fetching output data {0}
fr: La récupération en sortie de la donnée {0} a échoué

# OutputDataFailedCreatingPath
source: Failed creating return data path for {0}, that data won't be fetched
fr: La création du chemin de la donnée {0} a échoué, cette donnée ne sera pas récupérée

# ProcessingSendingAnswerToServer
source: Sending message to eListener [{0}]
fr: Envoi d'un message au eListener [{0}]

# ProcessingFoundCardBrand
source: Found card brand: {0}
fr: Réseau de la carte utilisée: {0}

# NeptingTimeoutReceiving
source: Timeout receiving a message
fr: Timeout lors de la réception d'un message

# NeptingIsNotReady
source: The Nepting link is not ready, function {0} can't be executed
fr: Le lien Nepting n'est pas actif, la fonction {0} ne peut être exécutée

# NeptingInvalidPath
source: Invalid path or not writeable ({0})
fr: Chemin invalide ou impossible d'écrire dans le répertoire ({0})

# NeptingError
source: Error while running {0}
fr: Erreur en exécutant {0}

# NeptingIsReady
source: The Nepting link is already setup, function {0} can't be executed
fr: Le lien Nepting est déjà actif, la fonction {0} ne peut être exécutée

# NeptingInvalidLogLevel
source: The specified log level is invalid ({0})
fr: Le niveau de log spécifié est invalide ({0})

# NeptingInvalidLogFileSize
source: Invalid log file size({0})
fr: Taille du fichier log invalide ({0})

# NeptingInvalidConnectionType
source: Invalid connection type specified ({0})
fr: Type de connexion invalide ({0})

# NeptingNoMessage
source: No message has been created
fr: Aucun message n'a été créé

# NeptingNoFieldName
source: No field name was specified to add to the message
fr: Aucun nom de donnée n'a été spécifié lors de l'ajout au message

# NeptingNoFieldValue
source: No field value was specified to add to the message for field {0}
fr: Aucun nom de donnée n'a été spécifié lors de l'ajout de la donnée {0} au message

# NeptingIsNotConnected
source: No active connection to a Nepting terminal
fr: Aucune connexion active à un terminal Nepting

# NeptingFieldNotPresent
source: The requested field {0} was not found in the message
fr: La donnée {0} n'a pas été trouvée dans le message

# NeptingFieldIndexNotPresent
source: The requested field {0} with index {1} was not found in the message
fr: La donnée {0} d'index {1} n'a pas été trouvée dans le message

# NeptingFailedCreatingMessage
source: Failed creating a Nepting message
fr: La création du message Nepting a échoué
